#    -*- mode: org -*-


Archived entries from file /home/amadev/emacs-conf/emacs.org


* Работа с БД
:PROPERTIES:
:ARCHIVE_TIME: 2023-07-09 Sun 13:42
:ARCHIVE_FILE: ~/emacs-conf/emacs.org
:ARCHIVE_OLPATH: emacs
:ARCHIVE_CATEGORY: emacs
:END:

Соединения описываются в sql-connection-alist.
Имя формируется, как название сервиса, тип (P - бой, l - прочее),
есть ли запись (ro, rw - default) опционально.
Пароль хранится в keepassx под тем же именем.

Для единоразовых подключений можно использовать sql-mysql, sql-postgres.
(require 'sql) нужен, т.к. там определяется sql-connection-alist, а
без определенной переменной add-to-list работать не будет.

#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
  (require 'sql)

  (add-to-list
   'sql-connection-alist
   '("postgres-l"
     (sql-product 'postgres)
     (sql-server "localhost")
     (sql-user "site")
     (sql-database "site")
     (sql-port 5432)))

  (add-to-list
   'sql-connection-alist
   '("devstack-l"
     (sql-product 'mysql)
     (sql-server "james")
     (sql-user "root")
     (sql-database "nova")
     (sql-port 3306)))
#+END_SRC

Интерактивно выбираем подключение, обновляем пароль в выбранной
структуре через get-pass, также пароль копируется в буфер (для
postgres).

#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
(defun sql-connect-with-pass (connection)
  (interactive
   (helm-comp-read "Select server: " (mapcar (lambda (item)
                                               (list
                                                (nth 0 item)
                                                (nth 0 item)))
                                             sql-connection-alist)))
  ;; get the sql connection info and product from the sql-connection-alist
  (let* ((connection-info (assoc connection sql-connection-alist))
         (connection-product (nth 1 (nth 1 (assoc 'sql-product connection-info))))
         (sql-password (get-pass connection)))
    (kill-new sql-password)
    ;; delete the connection info from the sql-connection-alist
    (setq sql-connection-alist (assq-delete-all connection sql-connection-alist))
    ;; delete the old password from the connection-info
    (setq connection-info (assq-delete-all 'sql-password connection-info))
    ;; add the password to the connection-info
    (nconc connection-info `((sql-password ,sql-password)))
    ;; add back the connection info to the beginning of sql-connection-alist
    ;; (last used server will appear first for the next prompt)
    (add-to-list 'sql-connection-alist connection-info)
    ;; override the sql-product by the product of this connection
    (setq sql-product connection-product)
    ;; connect
    (sql-connect connection connection)
    ;; (if current-prefix-arg
    ;;         (sql-connect connection connection)
    ;;       (sql-connect connection))
    ))
#+END_SRC

Добавляем перенос строки после ответа, т.к. при запросе из отдельного
буфера может не добавиться. Включается обрезка длинных строк, не
перенос.

#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
(global-set-key (kbd "C-c s s") 'sql-set-sqli-buffer)
(global-set-key (kbd "C-; d") 'sql-connect-with-pass)

(setq sql-mysql-options
      (list "--default-character-set=utf8" "-A"))

(defun sql-add-newline-first (output)
  "Add newline to beginning of OUTPUT for `comint-preoutput-filter-functions'"
  (concat "\n" output))

(defun sqli-add-hooks ()
  "Add hooks to `sql-interactive-mode-hook'."
  (add-hook 'comint-preoutput-filter-functions
            'sql-add-newline-first)
  (toggle-truncate-lines t))

(add-hook 'sql-interactive-mode-hook 'sqli-add-hooks)
#+END_SRC

Сохранение истории таким способом не работает при закрытии буфера,
поэтому нужно сначала убить процесс (TODO при закрытии буфера вызывать
сохранение истории).
#+BEGIN_SRC elisp :tangle ~/.emacs.d/init.el
;; comint-input-ring-size 500
  (defun my-sql-save-history-hook ()
    (let ((lval 'sql-input-ring-file-name)
          (rval 'sql-product))
      (if (symbol-value rval)
          (let ((filename
                 (concat "~/.emacs.d/history.d/"
                         (symbol-name (symbol-value rval))
                         "-history.sql")))
            (set (make-local-variable lval) filename))
        (error
         (format "SQL history will not be saved because %s is nil"
                 (symbol-name rval))))))

  (add-hook 'sql-interactive-mode-hook 'my-sql-save-history-hook)
#+END_SRC

#+RESULTS:
| my-sql-save-history-hook | sqli-add-hooks |

